IDEA Open Model
ReinfFireDiagramType Enumeration
Compatible with IDEA StatiCa 20.1
 Stress-strain reeinforcemnt diagram for fire
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum ReinfFireDiagramType
Public Enumeration ReinfFireDiagramType
Members
Member name | Value | Description
FireBilinerWithAnInclinedTopBranch | 0 |  Billinear with an inclined top branch
FireBilinerWithOutAnInclinedTopBranch | 1 |  Billinear without an inclined top branch
See Also
Reference
IdeaRS.OpenModel.Material Namespace